src/integration-test/resources/ComfactIT/__files/test7_createSigningRequestReturnsFault/mappings/CreateSigningInstance.json

{
	"request": {
		"method": "POST",
		"bodyPatterns": [
			{
				"equalToXml": "<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"no\"?><SOAP-ENV:Envelope xmlns:SOAP-ENV=\"http://schemas.xmlsoap.org/soap/envelope/\"><SOAP-ENV:Header/><SOAP-ENV:Body><CreateSigningInstanceRequest xmlns=\"urn:comfact:prosale:signing:2.0:protocol\" xmlns:ns2=\"urn:comfact:prosale:pagination:1.0:protocol\"><Credentials><UserId>sundsvall-username</UserId><Password>sundsvall-password</Password></Credentials><SigningInstanceInput language=\"sv\"><CustomerReferenceNumber>1234567890</CustomerReferenceNumber><Expires>2022-01-01T00:59:59.000+01:00</Expires><NotificationMessage language=\"sv\"><Subject>Please sign the document</Subject><Body>Dear John Doe, please sign the document.</Body></NotificationMessage><SignatoryReminder enabled=\"true\"><StartDate>2022-01-01T00:59:59.000+01:00</StartDate><HourInterval>24</HourInterval><ReminderMessage language=\"sv\"><Subject>Please sign the document</Subject><Body>Dear John Doe, please sign the document.</Body></ReminderMessage></SignatoryReminder><Initiator language=\"sv\" partyId=\"550e8400-e29b-41d4-a716-446655440000\"><Name>John Doe</Name><Title>CEO</Title><Organization>Sundsvall Municipality</Organization><PersonalNumber>197001011234</PersonalNumber><EmailAddress>john.doe@sundsvall.se</EmailAddress><MobilePhoneNumber>0701234567</MobilePhoneNumber></Initiator><AdditionalParty language=\"sv\" partyId=\"550e8400-e29b-41d4-a716-446655440000\"><Name>John Doe</Name><Title>CEO</Title><Organization>Sundsvall Municipality</Organization><PersonalNumber>197001011234</PersonalNumber><EmailAddress>john.doe@sundsvall.se</EmailAddress><MobilePhoneNumber>0701234567</MobilePhoneNumber></AdditionalParty><Signatory language=\"sv\" partyId=\"550e8400-e29b-41d4-a716-446655440000\"><Name>John Doe</Name><Title>CEO</Title><Organization>Sundsvall Municipality</Organization><PersonalNumber>197001011234</PersonalNumber><EmailAddress>john.doe@sundsvall.se</EmailAddress><MobilePhoneNumber>0701234567</MobilePhoneNumber><NotificationMessage language=\"sv\"><Subject>Please sign the document</Subject><Body>Dear John Doe, please sign the document.</Body></NotificationMessage><Identification><Alias>SmsCode</Alias></Identification></Signatory><Document><DocumentName>Business Contract</DocumentName><FileName>document.pdf</FileName><MimeType>application/pdf</MimeType><Content>ZEdWemRBPT0=</Content></Document><DocumentAttachment><DocumentName>Business Contract</DocumentName><FileName>document.pdf</FileName><MimeType>application/pdf</MimeType><Content>ZEdWemRBPT0=</Content></DocumentAttachment></SigningInstanceInput></CreateSigningInstanceRequest></SOAP-ENV:Body></SOAP-ENV:Envelope>"
			}
		],
		"url": "/comfact"
	},
	"response": {
		"headers": {
			"Content-Type": "text/xml"
		},
		"bodyFileName": "test7_createSigningRequestReturnsFault/responses/CreateSigningInstance.xml",
		"status": 200
	}
}
